package Day17;


public class ExtendQuiz01 {

	public static void main(String[] args) {
		
		//========================================
		
		System.out.println("===== 35번 문제 =====");	
		System.out.println();

//		동물게임
//		동물 클래스가 있습니다.
//		동물 클래스에는 이름과 색깔을 가지고 있습니다.
//		(get set 함수를 사용합니다. 모든 속성은 private 입니다.)
//		동물 클래스를 상속받는 개, 고양이, 새가 있습니다.
//		개는 짖는 기능, 고양이는 야옹하는 기능, 새는 날으는 기능이 있습니다.
//		---------------------------------------------------------
//		동물원에 개가 3마리 고양이2마리 새1마리가 있습니다.
//		이름표가 있습니다.
//		개 : "말티즈","요크셔테리어","포메라이안","시바","웰시코기"
//		고양이 : "먼치킨","스핑크스","뱅갈","샴","폴드"
//		새 : "앵무새","참새","닭","까마귀","비둘기"
//		색깔관련 표 : "갈색","검은색","흰색","노란색","점박이"
//		(랜덤 0 ~ 4로 해서 객체 생성시마다 랜덤 값을 추출 해주세요.)
//		
//		여기있는 이름표와 색깔을 랜덤으로 골라서 개, 고양이, 새의 객체를 만든 이후에 
//		3마리 개는 짖고 2마리 고양이는 야옹하고 새는 날아갑니다.
//		
//		예)
//		개 짖다(갈색의 시바는 짖는다.)
//		고양이 야옹하다.(흰색의 뱅갈은 야옹한다.)
//		새는 날아간다.(점박이의 까마귀는 날아다닌다.)
		
	}

}
