package Day16;


public class ClassQuiz08 {
	
	public static void main(String[] args) {
		
		//========================================
		
		System.out.println("===== 34번 문제 =====");	
		System.out.println();
		
//		타는 기계 프로그램
//		바퀴, 엔진 구성요소가 존재합니다.
//		자동차, 자전거, 오토바이, 비행기가 있습니다.
//		- 자동차에는 4개의 바퀴와 엔진 그리고 자동차 명 색깔을 가지고 있습니다.
//		  그리고 운전하는 기능이 있습니다.
//		  운전기능 : 차 명은 xxx이고, 색은 xxx색이다. 바퀴 제저사는 xxx이고 지름은 xxx, 생산된 결과는 xxx /
//			엔진의 마력은 xxx 사이즈는 xxx입니다.
//		- 자전거에는 색깔과 자전거 명 그리고 바퀴가 2개있다. 
//		  그리고 타다 기능이 있다.
//		  타다기능 : 자전거 명은 xxx 이고 xxx색이다. 바퀴의 제조사는 xxx이고, 지름은 xxx, 생산된 날짜는 xxx /
//			엔진의 마력은 xxx 사이즈는 xxx입니다.
//		- 오토바이에는 색깔 오토바이명 엔진, 바퀴 2개가 있다.
//		  그리고 타다 기능이 있다.
//		  타다기능 : 오토바이 명은 xxx이고 xxx색이다. 바퀴의 제조사는 xxx이고, 지름은 xxx, 생산된 날짜는 xxx /
//			엔진의 마력은 xxx 사이즈는 xxx입니다.
//		- 비행기에는 비행기 기종과 항공사가 있고 엔진과 바퀴 6개가 있다.
//		  날다기능 : 비행기 명은 xxx이고 항공사는 xxx이다. 바퀴의 제조사는 xxx이고, 지름은 xxx, 생산된 날짜는 xxx /
//			엔진의 마력은 xxx 사이즈는 xxx입니다.
//		
//		바퀴는 제조사, 직경, 생산된 날짜가 있다.
//		엔진은 마력, 크기가 있다.
//		
//		바퀴 공장에서 한국타이어 직경 20 생산된 날짜 2021.1.1 3개 (자동차 전용)
//				  넥슨타이어 직경 16 생산된 날짜 2020.12.1 5개 (자동차 전용)
//				  알톤 직경 10 생산된 날짜 2020.1.1 3개 (자전거 전용)
//				  집 직경 10 생산된 날짜 2019.12.31 1개 (자전거 전용)
//				  넥슨타이어 직경 14 생산된 날짜 2020.7.27 4개 (오토바이 전용)
//				  Bridgestone 직경 1100 생산된 날짜 2019.2.13 10개 (비행기 전용)
//		엔진 공장에서 마력 500 크기 50 5개
//				  마력 400 크기 40 4개
//				  마력 450 크기 20 3개
//				  마력 1000 크기 300 4개
//				  (엔진은 제한이 없습니다. 자전거는 엔진을 부착하지 않습니다.)
//		자동차 공장 / 자전거 공장 / 오토바이 공장 / 비행기 공장
//		각각의 공장에서는 각각의 타는 기계를 만들어서 판매를 합니다.
//		
//		소비자가 한명이 있습니다. 소비자가 각각의 공장에 가서 타는 기계를 주문하면 
//		바퀴수와 엔진요청한게 있으면 물건을 제작해서 소비자에게 주면 소비자가 그 물건을 받아서 각각의 타는 기계와 맞는 기능을 실행하시면 됩니다.
//		(만약에 바퀴의 재고가 없거나 엔진에 재고가 없게 되면 물건을 만들어 줄 수가 없습니다. 물건을 못만들어주면 고객에게 "죄송합니다."를 출력 해주면 됩니다.)
//		만약에 물건이 다 소진되면 각각의 공장의 영업을 종료 해주시면 됩니다.
//		
//		* 프로그램 실행 
//		1.자동차 공장 2.자전거 공장 3.오토바이 공장 4.비행기 공장 5.종료: 1(엔터)
//		1.바퀴선택 2.엔진선택 : 1(엔터)
//		1.한국타이어 2.넥슨타이어: 1(엔터)
//		바퀴갯수를 선택 해주세요 : 4(에러 죄송합니다.)
//		바퀴갯수를 선택 해주세요 : 3(엔터) 바퀴가 4개가 될 수 있도록 다시 바퀴 선택이 되야합니다. 
//		1.바퀴선택 2.엔진선택 : 2(엔터)
//		1.500마력 2.400마력 3.450마력 4.1000마력 : 4(엔터) <- 바퀴와 엔진이 끝나면
//		자동차 이름 : K7(엔터)
//		자동차 색깔 : 빨강(엔터) <- 자동차 완성
//		차명은 K7이고 색은 빨간색이다. 바퀴의 제조사는 한국타이어 이고 지름은 20, 
//		생산된 날짜는 2020.1.1/엔진의 마력은 400사이즈 40입니다.(출력)
//		//다시 시작
//		1.자동차 공장 2.자전거 공장 3.오토바이 공장 4.비행기 공장 5.종료 : 
		
		
		
	}	
}
