package Day16;


public class ClassQuiz07 {
	
	public static void main(String[] args) {
		
		//========================================
		
		System.out.println("===== 33번 문제 =====");	
		System.out.println();
		
//		원숭이 문제
//		원숭이가 총 5마리가 있습니다.
//		원숭이 한테는 상자를 가지고 있습니다.
//		그리고 원숭이는 각각의 5마리의 색깔이 있습니다.
//		1번 원숭이 : 빨간 / 2번 원숭이 : 노랑 / 3번 원숭이 : 파랑
//		4번 원숭이 : 초록 / 5번 원숭이 : 검정
//		그리고 원숭이가 스스로 "무슨 원숭이가 물건을 가지고 있습니다."
//		또는 "무슨 원숭이가 물건을 가지고 있지 않습니다."
//		가 출력이 되어야 합니다.
//		원숭이는 상자를 가질 수가 있어야 합니다.
//		
//		2가지 랜덤수를 받습니다.
//		하나는 1(우) / 0(좌)
//		또 하나는 횟수입니다.(1~5)까지 입니다.
		
//		게임을 시작합니다.
//		우선 제일 먼저 빨간 원숭이가 상자를 가지고 있습니다.
//		랜덤 값이 0 / 1 이면 
//		빨 -> 노 -> 파 -> 초 -> 검 (1) 우측으로 상자 이동
//		노 <- 파 <- 초 <- 검 <- 빨 (0) 좌측으로 상자 이동
		
		
		
	}	
}
